# статические массивы кнопок
COMMAND_LIST: list[str] = [
                "Узнать данные о студенте(ах)",
                "Внести данные о новом студенте",
                "Удалить данные о студенте",
                "Посмотреть таблицу"]

PICK_DELETE_COMMAND: list[str] = [
                      "По предмету",
                      "По семместру",
                      "Полностью студента"]

TYPE_COMMAND_DICTIONARY: dict[str, str] = {
    "Узнать данные о студенте(ах)": "SEND_INFO",
    "Внести данные о новом студенте": "INSERT", 
    "Удалить данные о студенте": "DELETE",
    "Посмотреть таблицу": "SEND_EXCEL", 
    "Полностью студента": "DELETE_ALL",
    "По семместру": "DELETE_SEMESTR",
    "По предмету": "DEELTE_OBJECT" 
}

OBJECT_LIST: list[str] = [ 
                "Математический анализ",
                "Физика.Механика",
                "Физика.Термодинамика",
                "Физика.Оптика",
                "Линейная алгебра", 
                "Технологии программирования", 
                "Дифференциальные уравнения"]

TYPE_COMMAND: str | None = None